## Update to HKRECON.py to pull values and variables based on metadata/.txt files that will be created with the installer.py script

In [2]:
import json
import pandas as pd

In [9]:
df = pd.read_excel('HERECON.xlsx')

In [10]:
df.head()

    Unnamed: 0  King Stayover  King Checkout  Queen Stayover  Queen Checkout
0     Cheyenne              1             11               0               6
1  Float Board              0              4               0               0
2   Hung Board              0              0               0               1
3       Johana              0             15               0               2
4  Juan Carlos              0              5               0               7

In [18]:
df.set_index(df['Unnamed: 0'],inplace=True)
df.drop(['Unnamed: 0'],axis=1,inplace=True)
df.head()

             King Stayover  King Checkout  Queen Stayover  Queen Checkout
Unnamed: 0
Cheyenne                 1             11               0               6
Float Board              0              4               0               0
Hung Board               0              0               0               1
Johana                   0             15               0               2
Juan Carlos              0              5               0               7

In [19]:
df.to_json('reconjson.json')

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, Cheyenne to Tameka
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   King Stayover   9 non-null      int64
 1   King Checkout   9 non-null      int64
 2   Queen Stayover  9 non-null      int64
 3   Queen Checkout  9 non-null      int64
dtypes: int64(4)
memory usage: 660.0+ bytes

In [26]:
creditVals = pd.read_json('datasetValues.json',orient='index')
creditVals.head()

                0
King Stayover   3
King Checkout   6
Queen Stayover  4
Queen Checkout  7
Suite Stayover  9